In [1]:
import pandas as pd

# sort

In [4]:
ser = pd.Series(list('CAD'),index=[2,1,3]) # 对值的排序
ser

2    C
1    A
3    D
dtype: object

In [5]:
ser.sort_index() # 按照索引排序

1    A
2    C
3    D
dtype: object

In [6]:
ser.sort_index(ascending=False) # 按照索引降序排列

3    D
2    C
1    A
dtype: object

In [7]:
ser.sort_values() # 按照值排序

1    A
2    C
3    D
dtype: object

In [8]:
ser.sort_values(ascending=False) # 按照值降序排列

3    D
2    C
1    A
dtype: object

In [9]:
ser = pd.Series(['E',None,'C']) # 当序列中有None值
ser

0       E
1    None
2       C
dtype: object

In [10]:
ser.sort_values()

2       C
0       E
1    None
dtype: object

In [12]:
ser.sort_values(ascending=False) # 无论对None值升序还是降序排列，它永远都在最后一位

0       E
2       C
1    None
dtype: object

In [14]:
arr = [[9,4,8],
      [4,6,7],
      [4,5,3]]
df = pd.DataFrame(arr, index=[0,2,1],columns=list('cab'))
df

   c  a  b
0  9  4  8
2  4  6  7
1  4  5  3

In [15]:
df.sort_index() # 对多元数据框架索引排序

   c  a  b
0  9  4  8
1  4  5  3
2  4  6  7

In [16]:
df.sort_index(axis=1) # 对多元数据列(标题)索引排序

   a  b  c
0  4  8  9
2  6  7  4
1  5  3  4

In [17]:
df

   c  a  b
0  9  4  8
2  4  6  7
1  4  5  3

In [18]:
df.sort_values(by='c') # 对c列的值进行排序

   c  a  b
2  4  6  7
1  4  5  3
0  9  4  8

In [19]:
df.sort_values(by=['c','a']) # 优先根据c列的值进行排序，再根据a列的值排序

   c  a  b
1  4  5  3
2  4  6  7
0  9  4  8

# rank

In [20]:
df

   c  a  b
0  9  4  8
2  4  6  7
1  4  5  3

In [21]:
df.rank() # 数据所返回的排名情况

     c    a    b
0  3.0  1.0  3.0
2  1.5  3.0  2.0
1  1.5  2.0  1.0

In [22]:
df.rank(method='first') # 指定排序方法，默认为average

     c    a    b
0  3.0  1.0  3.0
2  1.0  3.0  2.0
1  2.0  2.0  1.0

In [23]:
df.rank(method='max') # 指定排序方法为max

     c    a    b
0  3.0  1.0  3.0
2  2.0  3.0  2.0
1  2.0  2.0  1.0

In [24]:
df.rank(method='min') # 指定排序方法为min

     c    a    b
0  3.0  1.0  3.0
2  1.0  3.0  2.0
1  1.0  2.0  1.0

In [25]:
df.rank(method='min', ascending=False) # 指定排序方法为min，并为降序排列

     c    a    b
0  1.0  3.0  1.0
2  2.0  1.0  2.0
1  2.0  2.0  3.0

# merge

In [27]:
import numpy as np

In [28]:
df1 = pd.DataFrame({
    'stu_no':['s1','s2','s1','s3','s1','s1','s2','s4'],
    'score':np.random.randint(50,100,size=8)
})

In [29]:
df1

  stu_no  score
0     s1     94
1     s2     84
2     s1     88
3     s3     73
4     s1     91
5     s1     69
6     s2     76
7     s4     93

In [30]:
df2 = pd.DataFrame({
    'stu_no':['s1','s2','s3','s5'],
    'name':['张三','李四','王五','赵六']
})
df2

  stu_no name
0     s1   张三
1     s2   李四
2     s3   王五
3     s5   赵六

In [31]:
pd.merge(df1, df2, on='stu_no') # 对上面两个数据集做一个合并操作, on指定连接数据。此处写的是inner join

  stu_no  score name
0     s1     94   张三
1     s1     88   张三
2     s1     91   张三
3     s1     69   张三
4     s2     84   李四
5     s2     76   李四
6     s3     73   王五

In [32]:
pd.merge(df1, df2, on='stu_no', how='left') # 这里的how是指定连接方法，跟sql里的保持一致。这里是左连接

  stu_no  score name
0     s1     94   张三
1     s2     84   李四
2     s1     88   张三
3     s3     73   王五
4     s1     91   张三
5     s1     69   张三
6     s2     76   李四
7     s4     93  NaN

In [33]:
pd.merge(df1, df2, on='stu_no', how='right') # 这里的how是指定连接方法，跟sql里的保持一致。这里是右连接

  stu_no  score name
0     s1   94.0   张三
1     s1   88.0   张三
2     s1   91.0   张三
3     s1   69.0   张三
4     s2   84.0   李四
5     s2   76.0   李四
6     s3   73.0   王五
7     s5    NaN   赵六

In [35]:
pd.merge(df1, df2, on='stu_no', how='outer') # 这里的how是指定连接方法，跟sql里的保持一致。这里是外连接

  stu_no  score name
0     s1   94.0   张三
1     s1   88.0   张三
2     s1   91.0   张三
3     s1   69.0   张三
4     s2   84.0   李四
5     s2   76.0   李四
6     s3   73.0   王五
7     s4   93.0  NaN
8     s5    NaN   赵六

# concat

In [36]:
df1 = pd.DataFrame(np.arange(1,5).reshape(2,-1))
df1

   0  1
0  1  2
1  3  4

In [37]:
df2 = pd.DataFrame(np.zeros((2,2)))
df2

     0    1
0  0.0  0.0
1  0.0  0.0

In [38]:
pd.concat([df1,df2]) # 将两个数据集上下拼接

     0    1
0  1.0  2.0
1  3.0  4.0
0  0.0  0.0
1  0.0  0.0

In [39]:
pd.concat([df1,df2], axis = 1) # 将两个数据集左右拼接

   0  1    0    1
0  1  2  0.0  0.0
1  3  4  0.0  0.0